      * 住所
       01 ADDRESS-AREA.
      *    氏名
           05 ADDRESS-NAME     PIC X(50).
      *    フリガナ
           05 ADDRESS-KANA     PIC X(50).
      *    郵便番号
           05 ADDRESS-CODE     PIC X(7).
      *    住所1(都道府県市町村)
           05 ADDRESS-ADDRESS1 PIC X(100).
      *    住所2(都道府県市町村より後)
           05 ADDRESS-ADDRESS2 PIC X(100).
